<script>
export default {
  data() {
    return {
      email: '',
      password: '',
      emailRules: [
        (v) => !!v || 'メールアドレスは必須項目です。',
        (v) => (v && v.length <= 128) || 'メールアドレスは128文字以内で入力してください。',
        (v) =>
          /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/.test(
            v
          ) || 'メールアドレスの形式が正しくありません。',
      ],
      passwordRules: [
        (v) => !!v || 'パスワードは必須項目です。',
        (v) => (v && v.length <= 32) || 'パスワードは32文字以内で入力してください。',
      ],
    };
  },
};
</script>
